In [27]:
import pandas as pd

In [28]:
# Series de pandas
numeros = [3,5,7,9]
series = pd.Series(numeros)
series, type(series)

(0    3
 1    5
 2    7
 3    9
 dtype: int64,
 pandas.core.series.Series)

In [29]:
data = {
    "Nombre": ["Ana", "Luis", "Carlos", "Marta"],
    "Edad":[20, 43, 18, 35],
    "Ciudad":["Madrid", "Medellin", "Valencia", "Sevilla" ]
}
print(data), type(data)

{'Nombre': ['Ana', 'Luis', 'Carlos', 'Marta'], 'Edad': [20, 43, 18, 35], 'Ciudad': ['Madrid', 'Medellin', 'Valencia', 'Sevilla']}

(None, dict)

In [30]:
# Generacion de DataFrame a partir de un diccionario
df = pd.DataFrame(data = data)
df.head()

   Nombre  Edad    Ciudad
0     Ana    20    Madrid
1    Luis    43  Medellin
2  Carlos    18  Valencia
3   Marta    35   Sevilla

In [31]:
# Exportar dataframe a un archivo CSV
df.to_csv("data.csv")

In [32]:
#importar un dataframe desde un archivo CSV
import_df = pd.read_csv("data.csv", index_col = 0)
import_df.head()

   Nombre  Edad    Ciudad
0     Ana    20    Madrid
1    Luis    43  Medellin
2  Carlos    18  Valencia
3   Marta    35   Sevilla

In [33]:
#Seleccion de columna de datos
nombres = df["Nombre"]
nombres.head()

0       Ana
1      Luis
2    Carlos
3     Marta
Name: Nombre, dtype: object

In [34]:
df[["Nombre", "Ciudad"]]

   Nombre    Ciudad
0     Ana    Madrid
1    Luis  Medellin
2  Carlos  Valencia
3   Marta   Sevilla

In [35]:
fila = df.loc[1]
fila.head()

Nombre        Luis
Edad            43
Ciudad    Medellin
Name: 1, dtype: object

In [36]:
df[df["Edad"] > 20]

  Nombre  Edad    Ciudad
1   Luis    43  Medellin
3  Marta    35   Sevilla

In [37]:
(df["Nombre"].str.startswith("L"))

0    False
1     True
2    False
3    False
Name: Nombre, dtype: bool

In [38]:
filtro = (df["Edad"]>30) & (df["Ciudad"].str.startswith("M"))
df[filtro]

  Nombre  Edad    Ciudad
1   Luis    43  Medellin

In [39]:
df.query("Edad < 40")

   Nombre  Edad    Ciudad
0     Ana    20    Madrid
2  Carlos    18  Valencia
3   Marta    35   Sevilla

In [40]:
df[df["Nombre"].isin(["Carlos", "Ana", "Jose"])]

   Nombre  Edad    Ciudad
0     Ana    20    Madrid
2  Carlos    18  Valencia

In [41]:
import numpy as np

In [42]:
data = {
    "Nombre": ["Ana", "Luis", "Carlos", "Marta", "Jose", "Juan"],
    "Edad":[20, 43, np.nan, 35, 28, 50],
    "Ciudad":["Madrid", "Medellin", "Valencia", None, "Barcelona", "Bilbao" ],
}

df =pd.DataFrame(data)
df

   Nombre  Edad     Ciudad
0     Ana  20.0     Madrid
1    Luis  43.0   Medellin
2  Carlos   NaN   Valencia
3   Marta  35.0       None
4    Jose  28.0  Barcelona
5    Juan  50.0     Bilbao

In [43]:
# Rellenar valores nulos con la media de la columna
df_fill= df.fillna(
    {
        "Edad": df['Edad'].mean(),
        "Ciudad": "Desconocida"
        
    }
)
df_fill.head()

   Nombre  Edad       Ciudad
0     Ana  20.0       Madrid
1    Luis  43.0     Medellin
2  Carlos  35.2     Valencia
3   Marta  35.0  Desconocida
4    Jose  28.0    Barcelona

In [44]:
#Eliminacion valores nulos
df_sin_nan = df.dropna()
df_sin_nan.head()

  Nombre  Edad     Ciudad
0    Ana  20.0     Madrid
1   Luis  43.0   Medellin
4   Jose  28.0  Barcelona
5   Juan  50.0     Bilbao

In [45]:
#Remplazar valores de una columna
df_replace = df.replace(
    {
        "Ciudad": {None: "Desconocida"},
        "Edad": {np.nan: df['Edad'].mean()}
    }
)
df_replace.head()

   Nombre  Edad       Ciudad
0     Ana  20.0       Madrid
1    Luis  43.0     Medellin
2  Carlos  35.2     Valencia
3   Marta  35.0  Desconocida
4    Jose  28.0    Barcelona

In [46]:
# Interpolar valores
df_interpolado = df.copy()
df_interpolado["Edad"] = df["Edad"].interpolate()
df_interpolado.head()

   Nombre  Edad     Ciudad
0     Ana  20.0     Madrid
1    Luis  43.0   Medellin
2  Carlos  39.0   Valencia
3   Marta  35.0       None
4    Jose  28.0  Barcelona

In [47]:
data_duplicada= {
    "Nombre": ["Ana", "Luis", "Carlos", "Marta", "Jose", "Juan", "Ana", "Luis"],
    "Edad":[20, 43, np.nan, 35, 28, 50, 20, 43],
    "Ciudad":["Madrid", "Medellin", "Valencia", None, "Barcelona", "Bilbao", "Madrid", "Medellin"],
}
df_duplicados = pd.DataFrame(data_duplicada)
df_duplicados

   Nombre  Edad     Ciudad
0     Ana  20.0     Madrid
1    Luis  43.0   Medellin
2  Carlos   NaN   Valencia
3   Marta  35.0       None
4    Jose  28.0  Barcelona
5    Juan  50.0     Bilbao
6     Ana  20.0     Madrid
7    Luis  43.0   Medellin

In [48]:
# Eliminacion de duplicados
df_sin_duplicados = df_duplicados.drop_duplicates()
df_sin_duplicados

   Nombre  Edad     Ciudad
0     Ana  20.0     Madrid
1    Luis  43.0   Medellin
2  Carlos   NaN   Valencia
3   Marta  35.0       None
4    Jose  28.0  Barcelona
5    Juan  50.0     Bilbao

In [26]:
#Cambiar nombre de columnas
df_renombrado = df.rename(columns={"Nombre": "Name", "Edad": "Age", "Ciudad": "City"})
df_renombrado

     Name   Age       City
0     Ana  20.0     Madrid
1    Luis  43.0   Medellin
2  Carlos   NaN   Valencia
3   Marta  35.0       None
4    Jose  28.0  Barcelona
5    Juan  50.0     Bilbao

In [49]:
#Ordenar Columnas

columnasOrdenadas = ["Ciudad", "Edad", "Nombre"]
df_ordenado = df[columnasOrdenadas]
df_ordenado

      Ciudad  Edad  Nombre
0     Madrid  20.0     Ana
1   Medellin  43.0    Luis
2   Valencia   NaN  Carlos
3       None  35.0   Marta
4  Barcelona  28.0    Jose
5     Bilbao  50.0    Juan

In [54]:
data= {
    "Nombre": ["Ana", "Luis", "Carlos", "Marta", "Jose", "Juan", "Camilo"],
    "Edad":[20, 43, 30, 35, 28, 50, 40],
    "Ciudad":["Madrid", "Bilbao", "Valencia", "Valencia", "Barcelona", "Bilbao", "Valencia"],
    "Puntuacion": [85, 90, 78, 92, 88, 95, 80]
}
df =pd.DataFrame(data)
df

   Nombre  Edad     Ciudad  Puntuacion
0     Ana    20     Madrid          85
1    Luis    43     Bilbao          90
2  Carlos    30   Valencia          78
3   Marta    35   Valencia          92
4    Jose    28  Barcelona          88
5    Juan    50     Bilbao          95
6  Camilo    40   Valencia          80

In [55]:
#agrupacion de datos por ciudad
groupped = df.groupby("Ciudad")
print(groupped.groups)

{'Barcelona': [4], 'Bilbao': [1, 5], 'Madrid': [0], 'Valencia': [2, 3, 6]}

In [56]:
#Calcular la suma de las edades y la puntuacion por ciudad
aggregated_data= groupped.agg(
    {
        "Edad": "mean",
        "Puntuacion": "sum"
    }
)
aggregated_data

           Edad  Puntuacion
Ciudad
Barcelona  28.0          88
Bilbao     46.5         185
Madrid     20.0          85
Valencia   35.0         250